TWilmer/s6e2ccx.ethernet/src/s6e2ccxj/common/s6e2ccxj.h
typedef struct stc_canfd_cccr_field
{
    union {
        struct {
            __IO  uint32_t  INIT                 :1;
            __IO  uint32_t  CCE                  :1;
            __IO  uint32_t  ASM                  :1;
            __IO  uint32_t  CSA                  :1;
            __IO  uint32_t  CSR                  :1;
            __IO  uint32_t  MON                  :1;
            __IO  uint32_t  DAR                  :1;
            __IO  uint32_t  TEST                 :1;
            __IO  uint32_t  CME                  :2;
            __IO  uint32_t  CMR                  :2;
            __IO  uint32_t  FDO                  :1;
            __IO  uint32_t  FDBS                 :1;
            __IO  uint32_t  TXP                  :1;
            __IO  uint32_t  RESERVED1            :17;
        };
        struct {
            __IO  uint32_t  RESERVED0            :8;
            __IO  uint32_t  CME0                 :1;
            __IO  uint32_t  CME1                 :1;
            __IO  uint32_t  CMR0                 :1;
            __IO  uint32_t  CMR1                 :1;
            __IO  uint32_t  RESERVED2            :20;
        };
    };
} stc_canfd_cccr_field_t;

typedef struct stc_canfd_btp_field
{
    union {
        struct {
            __IO  uint32_t  SJW                  :4;
            __IO  uint32_t  TSEG2                :4;
            __IO  uint32_t  TSEG1                :6;
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  BRP                  :10;
            __IO  uint32_t  RESERVED2            :6;
        };
        struct {
            __IO  uint32_t  SJW0                 :1;
            __IO  uint32_t  SJW1                 :1;
            __IO  uint32_t  SJW2                 :1;
            __IO  uint32_t  SJW3                 :1;
            __IO  uint32_t  TSEG20               :1;
            __IO  uint32_t  TSEG21               :1;
            __IO  uint32_t  TSEG22               :1;
            __IO  uint32_t  TSEG23               :1;
            __IO  uint32_t  TSEG10               :1;
            __IO  uint32_t  TSEG11               :1;
            __IO  uint32_t  TSEG12               :1;
            __IO  uint32_t  TSEG13               :1;
            __IO  uint32_t  TSEG14               :1;
            __IO  uint32_t  TSEG15               :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  BRP0                 :1;
            __IO  uint32_t  BRP1                 :1;
            __IO  uint32_t  BRP2                 :1;
            __IO  uint32_t  BRP3                 :1;
            __IO  uint32_t  BRP4                 :1;
            __IO  uint32_t  BRP5                 :1;
            __IO  uint32_t  BRP6                 :1;
            __IO  uint32_t  BRP7                 :1;
            __IO  uint32_t  BRP8                 :1;
            __IO  uint32_t  BRP9                 :1;
            __IO  uint32_t  RESERVED3            :6;
        };
    };
} stc_canfd_btp_field_t;

typedef struct stc_canfd_tscc_field
{
    union {
        struct {
            __IO  uint32_t  TSS                  :2;
            __IO  uint32_t  RESERVED0            :14;
            __IO  uint32_t  TCP                  :4;
            __IO  uint32_t  RESERVED2            :12;
        };
        struct {
            __IO  uint32_t  TSS0                 :1;
            __IO  uint32_t  TSS1                 :1;
            __IO  uint32_t  RESERVED1            :14;
            __IO  uint32_t  TCP0                 :1;
            __IO  uint32_t  TCP1                 :1;
            __IO  uint32_t  TCP2                 :1;
            __IO  uint32_t  TCP3                 :1;
            __IO  uint32_t  RESERVED3            :12;
        };
    };
} stc_canfd_tscc_field_t;

typedef struct stc_canfd_tscv_field
{
    union {
        struct {
            __IO  uint32_t  TSC                  :16;
            __IO  uint32_t  RESERVED0            :16;
        };
        struct {
            __IO  uint32_t  TSC0                 :1;
            __IO  uint32_t  TSC1                 :1;
            __IO  uint32_t  TSC2                 :1;
            __IO  uint32_t  TSC3                 :1;
            __IO  uint32_t  TSC4                 :1;
            __IO  uint32_t  TSC5                 :1;
            __IO  uint32_t  TSC6                 :1;
            __IO  uint32_t  TSC7                 :1;
            __IO  uint32_t  TSC8                 :1;
            __IO  uint32_t  TSC9                 :1;
            __IO  uint32_t  TSC10                :1;
            __IO  uint32_t  TSC11                :1;
            __IO  uint32_t  TSC12                :1;
            __IO  uint32_t  TSC13                :1;
            __IO  uint32_t  TSC14                :1;
            __IO  uint32_t  TSC15                :1;
            __IO  uint32_t  RESERVED1            :16;
        };
    };
} stc_canfd_tscv_field_t;

typedef struct stc_canfd_tocc_field
{
    union {
        struct {
            __IO  uint32_t  ETOC                 :1;
            __IO  uint32_t  TOS                  :2;
            __IO  uint32_t  RESERVED1            :13;
            __IO  uint32_t  TOP                  :16;
        };
        struct {
            __IO  uint32_t  RESERVED0            :1;
            __IO  uint32_t  TOS0                 :1;
            __IO  uint32_t  TOS1                 :1;
            __IO  uint32_t  RESERVED2            :13;
            __IO  uint32_t  TOP0                 :1;
            __IO  uint32_t  TOP1                 :1;
            __IO  uint32_t  TOP2                 :1;
            __IO  uint32_t  TOP3                 :1;
            __IO  uint32_t  TOP4                 :1;
            __IO  uint32_t  TOP5                 :1;
            __IO  uint32_t  TOP6                 :1;
            __IO  uint32_t  TOP7                 :1;
            __IO  uint32_t  TOP8                 :1;
            __IO  uint32_t  TOP9                 :1;
            __IO  uint32_t  TOP10                :1;
            __IO  uint32_t  TOP11                :1;
            __IO  uint32_t  TOP12                :1;
            __IO  uint32_t  TOP13                :1;
            __IO  uint32_t  TOP14                :1;
            __IO  uint32_t  TOP15                :1;
        };
    };
} stc_canfd_tocc_field_t;

typedef struct stc_canfd_tocv_field
{
    union {
        struct {
            __IO  uint32_t  TOC                  :16;
            __IO  uint32_t  RESERVED0            :16;
        };
        struct {
            __IO  uint32_t  TOC0                 :1;
            __IO  uint32_t  TOC1                 :1;
            __IO  uint32_t  TOC2                 :1;
            __IO  uint32_t  TOC3                 :1;
            __IO  uint32_t  TOC4                 :1;
            __IO  uint32_t  TOC5                 :1;
            __IO  uint32_t  TOC6                 :1;
            __IO  uint32_t  TOC7                 :1;
            __IO  uint32_t  TOC8                 :1;
            __IO  uint32_t  TOC9                 :1;
            __IO  uint32_t  TOC10                :1;
            __IO  uint32_t  TOC11                :1;
            __IO  uint32_t  TOC12                :1;
            __IO  uint32_t  TOC13                :1;
            __IO  uint32_t  TOC14                :1;
            __IO  uint32_t  TOC15                :1;
            __IO  uint32_t  RESERVED1            :16;
        };
    };
} stc_canfd_tocv_field_t;

typedef struct stc_canfd_ecr_field
{
    union {
        struct {
            __IO  uint32_t  TEC                  :8;
            __IO  uint32_t  REC                  :7;
            __IO  uint32_t  RP                   :1;
            __IO  uint32_t  CEL                  :8;
            __IO  uint32_t  RESERVED1            :8;
        };
        struct {
            __IO  uint32_t  TEC0                 :1;
            __IO  uint32_t  TEC1                 :1;
            __IO  uint32_t  TEC2                 :1;
            __IO  uint32_t  TEC3                 :1;
            __IO  uint32_t  TEC4                 :1;
            __IO  uint32_t  TEC5                 :1;
            __IO  uint32_t  TEC6                 :1;
            __IO  uint32_t  TEC7                 :1;
            __IO  uint32_t  REC0                 :1;
            __IO  uint32_t  REC1                 :1;
            __IO  uint32_t  REC2                 :1;
            __IO  uint32_t  REC3                 :1;
            __IO  uint32_t  REC4                 :1;
            __IO  uint32_t  REC5                 :1;
            __IO  uint32_t  REC6                 :1;
            __IO  uint32_t  RESERVED0            :1;
            __IO  uint32_t  CEL0                 :1;
            __IO  uint32_t  CEL1                 :1;
            __IO  uint32_t  CEL2                 :1;
            __IO  uint32_t  CEL3                 :1;
            __IO  uint32_t  CEL4                 :1;
            __IO  uint32_t  CEL5                 :1;
            __IO  uint32_t  CEL6                 :1;
            __IO  uint32_t  CEL7                 :1;
            __IO  uint32_t  RESERVED2            :8;
        };
    };
} stc_canfd_ecr_field_t;

typedef struct stc_canfd_psr_field
{
    union {
        struct {
            __IO  uint32_t  LEC                  :3;
            __IO  uint32_t  ACT                  :2;
            __IO  uint32_t  EP                   :1;
            __IO  uint32_t  EW                   :1;
            __IO  uint32_t  BO                   :1;
            __IO  uint32_t  FLEC                 :3;
            __IO  uint32_t  RESI                 :1;
            __IO  uint32_t  RBRS                 :1;
            __IO  uint32_t  REDL                 :1;
            __IO  uint32_t  RESERVED1            :18;
        };
        struct {
            __IO  uint32_t  LEC0                 :1;
            __IO  uint32_t  LEC1                 :1;
            __IO  uint32_t  LEC2                 :1;
            __IO  uint32_t  ACT0                 :1;
            __IO  uint32_t  ACT1                 :1;
            __IO  uint32_t  RESERVED0            :3;
            __IO  uint32_t  FLEC0                :1;
            __IO  uint32_t  FLEC1                :1;
            __IO  uint32_t  FLEC2                :1;
            __IO  uint32_t  RESERVED2            :21;
        };
    };
} stc_canfd_psr_field_t;

