TWilmer/s6e2ccx.ethernet/src/s6e2ccxj/common/s6e2ccxj.h
typedef struct stc_canfd_fdecr_field
{
        __IO   uint8_t  SEIE                     :1;
        __IO   uint8_t  DEIE                     :1;
        __IO   uint8_t  CEREN                    :1;
        __IO   uint8_t  CEIV                     :1;
        __IO   uint8_t  RESERVED0                :4;
} stc_canfd_fdecr_field_t;

typedef struct stc_canfd_fdesr_field
{
        __IO   uint8_t  SEI                      :1;
        __IO   uint8_t  DEI                      :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_canfd_fdesr_field_t;

typedef struct stc_canfd_fdsear_field
{
    union {
        struct {
            __IO  uint16_t  SRA                  :16;
        };
        struct {
            __IO  uint16_t  SRA0                 :1;
            __IO  uint16_t  SRA1                 :1;
            __IO  uint16_t  SRA2                 :1;
            __IO  uint16_t  SRA3                 :1;
            __IO  uint16_t  SRA4                 :1;
            __IO  uint16_t  SRA5                 :1;
            __IO  uint16_t  SRA6                 :1;
            __IO  uint16_t  SRA7                 :1;
            __IO  uint16_t  SRA8                 :1;
            __IO  uint16_t  SRA9                 :1;
            __IO  uint16_t  SRA10                :1;
            __IO  uint16_t  SRA11                :1;
            __IO  uint16_t  SRA12                :1;
            __IO  uint16_t  SRA13                :1;
            __IO  uint16_t  SRA14                :1;
            __IO  uint16_t  SRA15                :1;
        };
    };
} stc_canfd_fdsear_field_t;

typedef struct stc_canfd_fdescr_field
{
        __IO   uint8_t  SEIC                     :1;
        __IO   uint8_t  DEIC                     :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_canfd_fdescr_field_t;

typedef struct stc_canfd_fddear_field
{
    union {
        struct {
            __IO  uint16_t  DRA                  :16;
        };
        struct {
            __IO  uint16_t  DRA0                 :1;
            __IO  uint16_t  DRA1                 :1;
            __IO  uint16_t  DRA2                 :1;
            __IO  uint16_t  DRA3                 :1;
            __IO  uint16_t  DRA4                 :1;
            __IO  uint16_t  DRA5                 :1;
            __IO  uint16_t  DRA6                 :1;
            __IO  uint16_t  DRA7                 :1;
            __IO  uint16_t  DRA8                 :1;
            __IO  uint16_t  DRA9                 :1;
            __IO  uint16_t  DRA10                :1;
            __IO  uint16_t  DRA11                :1;
            __IO  uint16_t  DRA12                :1;
            __IO  uint16_t  DRA13                :1;
            __IO  uint16_t  DRA14                :1;
            __IO  uint16_t  DRA15                :1;
        };
    };
} stc_canfd_fddear_field_t;

typedef struct stc_canfd_tscntr_field
{
        __IO  uint16_t  CCLR                     :1;
        __IO  uint16_t  RESERVED0                :15;
} stc_canfd_tscntr_field_t;

typedef struct stc_canfd_tsmdr_field
{
        __IO  uint16_t  CNTEN                    :1;
        __IO  uint16_t  RESERVED0                :15;
} stc_canfd_tsmdr_field_t;

typedef struct stc_canfd_tsdivr_field
{
    union {
        struct {
            __IO  uint32_t  CDIV                 :16;
            __IO  uint32_t  RESERVED0            :16;
        };
        struct {
            __IO  uint32_t  CDIV0                :1;
            __IO  uint32_t  CDIV1                :1;
            __IO  uint32_t  CDIV2                :1;
            __IO  uint32_t  CDIV3                :1;
            __IO  uint32_t  CDIV4                :1;
            __IO  uint32_t  CDIV5                :1;
            __IO  uint32_t  CDIV6                :1;
            __IO  uint32_t  CDIV7                :1;
            __IO  uint32_t  CDIV8                :1;
            __IO  uint32_t  CDIV9                :1;
            __IO  uint32_t  CDIV10               :1;
            __IO  uint32_t  CDIV11               :1;
            __IO  uint32_t  CDIV12               :1;
            __IO  uint32_t  CDIV13               :1;
            __IO  uint32_t  CDIV14               :1;
            __IO  uint32_t  CDIV15               :1;
            __IO  uint32_t  RESERVED1            :16;
        };
    };
} stc_canfd_tsdivr_field_t;

typedef struct stc_canfd_tscdtr_field
{
    union {
        struct {
            __IO  uint16_t  CNT                  :16;
        };
        struct {
            __IO  uint16_t  CNT0                 :1;
            __IO  uint16_t  CNT1                 :1;
            __IO  uint16_t  CNT2                 :1;
            __IO  uint16_t  CNT3                 :1;
            __IO  uint16_t  CNT4                 :1;
            __IO  uint16_t  CNT5                 :1;
            __IO  uint16_t  CNT6                 :1;
            __IO  uint16_t  CNT7                 :1;
            __IO  uint16_t  CNT8                 :1;
            __IO  uint16_t  CNT9                 :1;
            __IO  uint16_t  CNT10                :1;
            __IO  uint16_t  CNT11                :1;
            __IO  uint16_t  CNT12                :1;
            __IO  uint16_t  CNT13                :1;
            __IO  uint16_t  CNT14                :1;
            __IO  uint16_t  CNT15                :1;
        };
    };
} stc_canfd_tscdtr_field_t;

typedef struct stc_canfd_tscpclr_field
{
    union {
        struct {
            __IO  uint16_t  CMP                  :16;
        };
        struct {
            __IO  uint16_t  CMP0                 :1;
            __IO  uint16_t  CMP1                 :1;
            __IO  uint16_t  CMP2                 :1;
            __IO  uint16_t  CMP3                 :1;
            __IO  uint16_t  CMP4                 :1;
            __IO  uint16_t  CMP5                 :1;
            __IO  uint16_t  CMP6                 :1;
            __IO  uint16_t  CMP7                 :1;
            __IO  uint16_t  CMP8                 :1;
            __IO  uint16_t  CMP9                 :1;
            __IO  uint16_t  CMP10                :1;
            __IO  uint16_t  CMP11                :1;
            __IO  uint16_t  CMP12                :1;
            __IO  uint16_t  CMP13                :1;
            __IO  uint16_t  CMP14                :1;
            __IO  uint16_t  CMP15                :1;
        };
    };
} stc_canfd_tscpclr_field_t;

