TWilmer/s6e2ccx.ethernet/src/s6e2ccxj/common/s6e2ccxj.h
typedef struct stc_gpio_pdsr6_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  RESERVED0                :8;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  RESERVED1                :17;
} stc_gpio_pdsr6_field_t;

typedef struct stc_gpio_pdsr7_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  PD                       :1;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  RESERVED0                :17;
} stc_gpio_pdsr7_field_t;

typedef struct stc_gpio_pdsr8_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED0                :28;
} stc_gpio_pdsr8_field_t;

typedef struct stc_gpio_pdsr9_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  RESERVED0                :26;
} stc_gpio_pdsr9_field_t;

typedef struct stc_gpio_pdsra_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  PD                       :1;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  PF                       :1;
        __IO  uint32_t  RESERVED0                :16;
} stc_gpio_pdsra_field_t;

typedef struct stc_gpio_pdsrb_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  RESERVED0                :24;
} stc_gpio_pdsrb_field_t;

typedef struct stc_gpio_pdsrc_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  PD                       :1;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  PF                       :1;
        __IO  uint32_t  RESERVED0                :16;
} stc_gpio_pdsrc_field_t;

typedef struct stc_gpio_pdsrd_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_gpio_pdsrd_field_t;

typedef struct stc_gpio_pdsre_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  RESERVED0                :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED1                :28;
} stc_gpio_pdsre_field_t;

typedef struct stc_gpio_pdsrf_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  RESERVED0                :24;
} stc_gpio_pdsrf_field_t;

/*******************************************************************************
* HSSPI_MODULE
*******************************************************************************/
typedef struct stc_hsspi_mctrl_field
{
        __IO  uint32_t  MEN                      :1;
        __IO  uint32_t  CSEN                     :1;
        __IO  uint32_t  RESERVED0                :2;
        __IO  uint32_t  MES                      :1;
        __IO  uint32_t  SYNCON                   :1;
        __IO  uint32_t  RESERVED1                :26;
} stc_hsspi_mctrl_field_t;

typedef struct stc_hsspi_pcc0_field
{
    union {
        struct {
            __IO  uint32_t  CPHA                 :1;
            __IO  uint32_t  CPOL                 :1;
            __IO  uint32_t  ACES                 :1;
            __IO  uint32_t  RTM                  :1;
            __IO  uint32_t  SSPOL                :1;
            __IO  uint32_t  SS2CD                :2;
            __IO  uint32_t  SDIR                 :1;
            __IO  uint32_t  SENDIAN              :1;
            __IO  uint32_t  CDRS                 :7;
            __IO  uint32_t  SAFESYNC             :1;
            __IO  uint32_t  WRDSEL               :4;
            __IO  uint32_t  RDDSEL               :2;
            __IO  uint32_t  RESERVED3            :9;
        };
        struct {
            __IO  uint32_t  RESERVED0            :5;
            __IO  uint32_t  SS2CD0               :1;
            __IO  uint32_t  SS2CD1               :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  CDRS0                :1;
            __IO  uint32_t  CDRS1                :1;
            __IO  uint32_t  CDRS2                :1;
            __IO  uint32_t  CDRS3                :1;
            __IO  uint32_t  CDRS4                :1;
            __IO  uint32_t  CDRS5                :1;
            __IO  uint32_t  CDRS6                :1;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  WRDSEL0              :1;
            __IO  uint32_t  WRDSEL1              :1;
            __IO  uint32_t  WRDSEL2              :1;
            __IO  uint32_t  WRDSEL3              :1;
            __IO  uint32_t  RDDSEL0              :1;
            __IO  uint32_t  RDDSEL1              :1;
            __IO  uint32_t  RESERVED4            :9;
        };
    };
} stc_hsspi_pcc0_field_t;

typedef struct stc_hsspi_pcc1_field
{
    union {
        struct {
            __IO  uint32_t  CPHA                 :1;
            __IO  uint32_t  CPOL                 :1;
            __IO  uint32_t  ACES                 :1;
            __IO  uint32_t  RTM                  :1;
            __IO  uint32_t  SSPOL                :1;
            __IO  uint32_t  SS2CD                :2;
            __IO  uint32_t  SDIR                 :1;
            __IO  uint32_t  SENDIAN              :1;
            __IO  uint32_t  CDRS                 :7;
            __IO  uint32_t  SAFESYNC             :1;
            __IO  uint32_t  WRDSEL               :4;
            __IO  uint32_t  RDDSEL               :2;
            __IO  uint32_t  RESERVED3            :9;
        };
        struct {
            __IO  uint32_t  RESERVED0            :5;
            __IO  uint32_t  SS2CD0               :1;
            __IO  uint32_t  SS2CD1               :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  CDRS0                :1;
            __IO  uint32_t  CDRS1                :1;
            __IO  uint32_t  CDRS2                :1;
            __IO  uint32_t  CDRS3                :1;
            __IO  uint32_t  CDRS4                :1;
            __IO  uint32_t  CDRS5                :1;
            __IO  uint32_t  CDRS6                :1;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  WRDSEL0              :1;
            __IO  uint32_t  WRDSEL1              :1;
            __IO  uint32_t  WRDSEL2              :1;
            __IO  uint32_t  WRDSEL3              :1;
            __IO  uint32_t  RDDSEL0              :1;
            __IO  uint32_t  RDDSEL1              :1;
            __IO  uint32_t  RESERVED4            :9;
        };
    };
} stc_hsspi_pcc1_field_t;

typedef struct stc_hsspi_pcc2_field
{
    union {
        struct {
            __IO  uint32_t  CPHA                 :1;
            __IO  uint32_t  CPOL                 :1;
            __IO  uint32_t  ACES                 :1;
            __IO  uint32_t  RTM                  :1;
            __IO  uint32_t  SSPOL                :1;
            __IO  uint32_t  SS2CD                :2;
            __IO  uint32_t  SDIR                 :1;
            __IO  uint32_t  SENDIAN              :1;
            __IO  uint32_t  CDRS                 :7;
            __IO  uint32_t  SAFESYNC             :1;
            __IO  uint32_t  WRDSEL               :4;
            __IO  uint32_t  RDDSEL               :2;
            __IO  uint32_t  RESERVED3            :9;
        };
        struct {
            __IO  uint32_t  RESERVED0            :5;
            __IO  uint32_t  SS2CD0               :1;
            __IO  uint32_t  SS2CD1               :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  CDRS0                :1;
            __IO  uint32_t  CDRS1                :1;
            __IO  uint32_t  CDRS2                :1;
            __IO  uint32_t  CDRS3                :1;
            __IO  uint32_t  CDRS4                :1;
            __IO  uint32_t  CDRS5                :1;
            __IO  uint32_t  CDRS6                :1;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  WRDSEL0              :1;
            __IO  uint32_t  WRDSEL1              :1;
            __IO  uint32_t  WRDSEL2              :1;
            __IO  uint32_t  WRDSEL3              :1;
            __IO  uint32_t  RDDSEL0              :1;
            __IO  uint32_t  RDDSEL1              :1;
            __IO  uint32_t  RESERVED4            :9;
        };
    };
} stc_hsspi_pcc2_field_t;

typedef struct stc_hsspi_pcc3_field
{
    union {
        struct {
            __IO  uint32_t  CPHA                 :1;
            __IO  uint32_t  CPOL                 :1;
            __IO  uint32_t  ACES                 :1;
            __IO  uint32_t  RTM                  :1;
            __IO  uint32_t  SSPOL                :1;
            __IO  uint32_t  SS2CD                :2;
            __IO  uint32_t  SDIR                 :1;
            __IO  uint32_t  SENDIAN              :1;
            __IO  uint32_t  CDRS                 :7;
            __IO  uint32_t  SAFESYNC             :1;
            __IO  uint32_t  WRDSEL               :4;
            __IO  uint32_t  RDDSEL               :2;
            __IO  uint32_t  RESERVED3            :9;
        };
        struct {
            __IO  uint32_t  RESERVED0            :5;
            __IO  uint32_t  SS2CD0               :1;
            __IO  uint32_t  SS2CD1               :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  CDRS0                :1;
            __IO  uint32_t  CDRS1                :1;
            __IO  uint32_t  CDRS2                :1;
            __IO  uint32_t  CDRS3                :1;
            __IO  uint32_t  CDRS4                :1;
            __IO  uint32_t  CDRS5                :1;
            __IO  uint32_t  CDRS6                :1;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  WRDSEL0              :1;
            __IO  uint32_t  WRDSEL1              :1;
            __IO  uint32_t  WRDSEL2              :1;
            __IO  uint32_t  WRDSEL3              :1;
            __IO  uint32_t  RDDSEL0              :1;
            __IO  uint32_t  RDDSEL1              :1;
            __IO  uint32_t  RESERVED4            :9;
        };
    };
} stc_hsspi_pcc3_field_t;

typedef struct stc_hsspi_txf_field
{
        __IO  uint32_t  TFFS                     :1;
        __IO  uint32_t  TFES                     :1;
        __IO  uint32_t  TFOS                     :1;
        __IO  uint32_t  TFUS                     :1;
        __IO  uint32_t  TFLETS                   :1;
        __IO  uint32_t  TFMTS                    :1;
        __IO  uint32_t  TSSRS                    :1;
        __IO  uint32_t  RESERVED0                :25;
} stc_hsspi_txf_field_t;

