TWilmer/s6e2ccx.ethernet/src/s6e2ccxj/common/s6e2ccxj.h
typedef struct stc_sdif_sshbctll_field
{
    union {
        struct {
            __IO  uint16_t  CLCKPIN              :3;
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  INTINPIN             :2;
            __IO  uint16_t  RESERVED2            :2;
            __IO  uint16_t  BUSWDPRST            :7;
            __IO  uint16_t  RESERVED4            :1;
        };
        struct {
            __IO  uint16_t  CLCKPIN0             :1;
            __IO  uint16_t  CLCKPIN1             :1;
            __IO  uint16_t  CLCKPIN2             :1;
            __IO  uint16_t  RESERVED1            :1;
            __IO  uint16_t  INTINPIN0            :1;
            __IO  uint16_t  INTINPIN1            :1;
            __IO  uint16_t  RESERVED3            :2;
            __IO  uint16_t  BUSWDPRST0           :1;
            __IO  uint16_t  BUSWDPRST1           :1;
            __IO  uint16_t  BUSWDPRST2           :1;
            __IO  uint16_t  BUSWDPRST3           :1;
            __IO  uint16_t  BUSWDPRST4           :1;
            __IO  uint16_t  BUSWDPRST5           :1;
            __IO  uint16_t  BUSWDPRST6           :1;
            __IO  uint16_t  RESERVED5            :1;
        };
    };
} stc_sdif_sshbctll_field_t;

typedef struct stc_sdif_sshbctlh_field
{
    union {
        struct {
            __IO  uint16_t  CLCKPINSEL           :3;
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  INTPINSEL            :3;
            __IO  uint16_t  RESERVED2            :1;
            __IO  uint16_t  BEPWRCTL             :7;
            __IO  uint16_t  RESERVED4            :1;
        };
        struct {
            __IO  uint16_t  CLCKPINSEL0          :1;
            __IO  uint16_t  CLCKPINSEL1          :1;
            __IO  uint16_t  CLCKPINSEL2          :1;
            __IO  uint16_t  RESERVED1            :1;
            __IO  uint16_t  INTPINSEL0           :1;
            __IO  uint16_t  INTPINSEL1           :1;
            __IO  uint16_t  INTPINSEL2           :1;
            __IO  uint16_t  RESERVED3            :1;
            __IO  uint16_t  BEPWRCTL0            :1;
            __IO  uint16_t  BEPWRCTL1            :1;
            __IO  uint16_t  BEPWRCTL2            :1;
            __IO  uint16_t  BEPWRCTL3            :1;
            __IO  uint16_t  BEPWRCTL4            :1;
            __IO  uint16_t  BEPWRCTL5            :1;
            __IO  uint16_t  BEPWRCTL6            :1;
            __IO  uint16_t  RESERVED5            :1;
        };
    };
} stc_sdif_sshbctlh_field_t;

typedef struct stc_sdif_sslist_field
{
    union {
        struct {
            __IO  uint16_t  SLOTINTSGN           :8;
            __IO  uint16_t  RESERVED0            :8;
        };
        struct {
            __IO  uint16_t  SLOTINTSGN0          :1;
            __IO  uint16_t  SLOTINTSGN1          :1;
            __IO  uint16_t  SLOTINTSGN2          :1;
            __IO  uint16_t  SLOTINTSGN3          :1;
            __IO  uint16_t  SLOTINTSGN4          :1;
            __IO  uint16_t  SLOTINTSGN5          :1;
            __IO  uint16_t  SLOTINTSGN6          :1;
            __IO  uint16_t  SLOTINTSGN7          :1;
            __IO  uint16_t  RESERVED1            :8;
        };
    };
} stc_sdif_sslist_field_t;

typedef struct stc_sdif_shctlv_field
{
    union {
        struct {
            __IO  uint16_t  SPECVERNUM           :8;
            __IO  uint16_t  VNDVERNUM            :8;
        };
        struct {
            __IO  uint16_t  SPECVERNUM0          :1;
            __IO  uint16_t  SPECVERNUM1          :1;
            __IO  uint16_t  SPECVERNUM2          :1;
            __IO  uint16_t  SPECVERNUM3          :1;
            __IO  uint16_t  SPECVERNUM4          :1;
            __IO  uint16_t  SPECVERNUM5          :1;
            __IO  uint16_t  SPECVERNUM6          :1;
            __IO  uint16_t  SPECVERNUM7          :1;
            __IO  uint16_t  VNDVERNUM0           :1;
            __IO  uint16_t  VNDVERNUM1           :1;
            __IO  uint16_t  VNDVERNUM2           :1;
            __IO  uint16_t  VNDVERNUM3           :1;
            __IO  uint16_t  VNDVERNUM4           :1;
            __IO  uint16_t  VNDVERNUM5           :1;
            __IO  uint16_t  VNDVERNUM6           :1;
            __IO  uint16_t  VNDVERNUM7           :1;
        };
    };
} stc_sdif_shctlv_field_t;

typedef struct stc_sdif_ahbcfgl_field
{
    union {
        struct {
            __IO  uint16_t  INCRSEL              :3;
            __IO  uint16_t  SINEN                :1;
            __IO  uint16_t  BSLOCK               :1;
            __IO  uint16_t  BSLOCKSEL            :1;
            __IO  uint16_t  ENDIANSEL            :1;
            __IO  uint16_t  RESERVED0            :9;
        };
        struct {
            __IO  uint16_t  INCRSEL0             :1;
            __IO  uint16_t  INCRSEL1             :1;
            __IO  uint16_t  INCRSEL2             :1;
            __IO  uint16_t  RESERVED1            :13;
        };
    };
} stc_sdif_ahbcfgl_field_t;

typedef struct stc_sdif_spwswcl_field
{
        __IO  uint16_t  ATPWRSWEN                :1;
        __IO  uint16_t  IOREGSEL                 :1;
        __IO  uint16_t  RESERVED0                :14;
} stc_sdif_spwswcl_field_t;

typedef struct stc_sdif_stunsetl_field
{
    union {
        struct {
            __IO  uint16_t  TNPTSEL              :8;
            __IO  uint16_t  TNPHSELEN            :1;
            __IO  uint16_t  TNERRBDSEL           :1;
            __IO  uint16_t  RETNTAPSEL           :1;
            __IO  uint16_t  RETNRNGSEL           :2;
            __IO  uint16_t  RESERVED1            :3;
        };
        struct {
            __IO  uint16_t  TNPTSEL0             :1;
            __IO  uint16_t  TNPTSEL1             :1;
            __IO  uint16_t  TNPTSEL2             :1;
            __IO  uint16_t  TNPTSEL3             :1;
            __IO  uint16_t  TNPTSEL4             :1;
            __IO  uint16_t  TNPTSEL5             :1;
            __IO  uint16_t  TNPTSEL6             :1;
            __IO  uint16_t  TNPTSEL7             :1;
            __IO  uint16_t  RESERVED0            :3;
            __IO  uint16_t  RETNRNGSEL0          :1;
            __IO  uint16_t  RETNRNGSEL1          :1;
            __IO  uint16_t  RESERVED2            :3;
        };
    };
} stc_sdif_stunsetl_field_t;

typedef struct stc_sdif_stunseth_field
{
    union {
        struct {
            __IO  uint16_t  CMDCFCHKDS           :1;
            __IO  uint16_t  RESERVED0            :7;
            __IO  uint16_t  DTOTCNTVAL           :4;
            __IO  uint16_t  RESERVED2            :4;
        };
        struct {
            __IO  uint16_t  RESERVED1            :8;
            __IO  uint16_t  DTOTCNTVAL0          :1;
            __IO  uint16_t  DTOTCNTVAL1          :1;
            __IO  uint16_t  DTOTCNTVAL2          :1;
            __IO  uint16_t  DTOTCNTVAL3          :1;
            __IO  uint16_t  RESERVED3            :4;
        };
    };
} stc_sdif_stunseth_field_t;

typedef struct stc_sdif_stunstl_field
{
    union {
        struct {
            __IO  uint16_t  REP8TNRSLT           :8;
            __IO  uint16_t  REP3TNRSLT           :3;
            __IO  uint16_t  RESERVED0            :5;
        };
        struct {
            __IO  uint16_t  REP8TNRSLT0          :1;
            __IO  uint16_t  REP8TNRSLT1          :1;
            __IO  uint16_t  REP8TNRSLT2          :1;
            __IO  uint16_t  REP8TNRSLT3          :1;
            __IO  uint16_t  REP8TNRSLT4          :1;
            __IO  uint16_t  REP8TNRSLT5          :1;
            __IO  uint16_t  REP8TNRSLT6          :1;
            __IO  uint16_t  REP8TNRSLT7          :1;
            __IO  uint16_t  REP3TNRSLT0          :1;
            __IO  uint16_t  REP3TNRSLT1          :1;
            __IO  uint16_t  REP3TNRSLT2          :1;
            __IO  uint16_t  RESERVED1            :5;
        };
    };
} stc_sdif_stunstl_field_t;

