TWilmer/s6e2ccx.ethernet/src/s6e2ccxj/common/s6e2ccxj.h
#define bFM_CANFD0_RXF1S_F1F                      *((volatile  uint8_t *)(0x42E016E0UL))
#define bFM4_CANFD0_RXF1S_F1F                     *((volatile  uint8_t *)(0x42E016E0UL))
#define bFM_CANFD0_RXF1S_RF1L                     *((volatile  uint8_t *)(0x42E016E4UL))
#define bFM4_CANFD0_RXF1S_RF1L                    *((volatile  uint8_t *)(0x42E016E4UL))

#define bFM_CANFD0_TEST_LBCK                      *((volatile  uint8_t *)(0x42E00210UL))
#define bFM4_CANFD0_TEST_LBCK                     *((volatile  uint8_t *)(0x42E00210UL))
#define bFM_CANFD0_TEST_RX                        *((volatile  uint8_t *)(0x42E0021CUL))
#define bFM4_CANFD0_TEST_RX                       *((volatile  uint8_t *)(0x42E0021CUL))

#define bFM_CANFD0_TOCC_ETOC                      *((volatile  uint8_t *)(0x42E00500UL))
#define bFM4_CANFD0_TOCC_ETOC                     *((volatile  uint8_t *)(0x42E00500UL))

#define bFM_CANFD0_TSCNTR_CCLR                    *((volatile  uint8_t *)(0x42E04200UL))
#define bFM4_CANFD0_TSCNTR_CCLR                   *((volatile  uint8_t *)(0x42E04200UL))

#define bFM_CANFD0_TSMDR_CNTEN                    *((volatile  uint8_t *)(0x42E04240UL))
#define bFM4_CANFD0_TSMDR_CNTEN                   *((volatile  uint8_t *)(0x42E04240UL))

#define bFM_CANFD0_TXBAR_AR0                      *((volatile  uint8_t *)(0x42E01A00UL))
#define bFM4_CANFD0_TXBAR_AR0                     *((volatile  uint8_t *)(0x42E01A00UL))
#define bFM_CANFD0_TXBAR_AR1                      *((volatile  uint8_t *)(0x42E01A04UL))
#define bFM4_CANFD0_TXBAR_AR1                     *((volatile  uint8_t *)(0x42E01A04UL))
#define bFM_CANFD0_TXBAR_AR2                      *((volatile  uint8_t *)(0x42E01A08UL))
#define bFM4_CANFD0_TXBAR_AR2                     *((volatile  uint8_t *)(0x42E01A08UL))
#define bFM_CANFD0_TXBAR_AR3                      *((volatile  uint8_t *)(0x42E01A0CUL))
#define bFM4_CANFD0_TXBAR_AR3                     *((volatile  uint8_t *)(0x42E01A0CUL))
#define bFM_CANFD0_TXBAR_AR4                      *((volatile  uint8_t *)(0x42E01A10UL))
#define bFM4_CANFD0_TXBAR_AR4                     *((volatile  uint8_t *)(0x42E01A10UL))
#define bFM_CANFD0_TXBAR_AR5                      *((volatile  uint8_t *)(0x42E01A14UL))
#define bFM4_CANFD0_TXBAR_AR5                     *((volatile  uint8_t *)(0x42E01A14UL))
#define bFM_CANFD0_TXBAR_AR6                      *((volatile  uint8_t *)(0x42E01A18UL))
#define bFM4_CANFD0_TXBAR_AR6                     *((volatile  uint8_t *)(0x42E01A18UL))
#define bFM_CANFD0_TXBAR_AR7                      *((volatile  uint8_t *)(0x42E01A1CUL))
#define bFM4_CANFD0_TXBAR_AR7                     *((volatile  uint8_t *)(0x42E01A1CUL))
#define bFM_CANFD0_TXBAR_AR8                      *((volatile  uint8_t *)(0x42E01A20UL))
#define bFM4_CANFD0_TXBAR_AR8                     *((volatile  uint8_t *)(0x42E01A20UL))
#define bFM_CANFD0_TXBAR_AR9                      *((volatile  uint8_t *)(0x42E01A24UL))
#define bFM4_CANFD0_TXBAR_AR9                     *((volatile  uint8_t *)(0x42E01A24UL))
#define bFM_CANFD0_TXBAR_AR10                     *((volatile  uint8_t *)(0x42E01A28UL))
#define bFM4_CANFD0_TXBAR_AR10                    *((volatile  uint8_t *)(0x42E01A28UL))
#define bFM_CANFD0_TXBAR_AR11                     *((volatile  uint8_t *)(0x42E01A2CUL))
#define bFM4_CANFD0_TXBAR_AR11                    *((volatile  uint8_t *)(0x42E01A2CUL))
#define bFM_CANFD0_TXBAR_AR12                     *((volatile  uint8_t *)(0x42E01A30UL))
#define bFM4_CANFD0_TXBAR_AR12                    *((volatile  uint8_t *)(0x42E01A30UL))
#define bFM_CANFD0_TXBAR_AR13                     *((volatile  uint8_t *)(0x42E01A34UL))
#define bFM4_CANFD0_TXBAR_AR13                    *((volatile  uint8_t *)(0x42E01A34UL))
#define bFM_CANFD0_TXBAR_AR14                     *((volatile  uint8_t *)(0x42E01A38UL))
#define bFM4_CANFD0_TXBAR_AR14                    *((volatile  uint8_t *)(0x42E01A38UL))
#define bFM_CANFD0_TXBAR_AR15                     *((volatile  uint8_t *)(0x42E01A3CUL))
#define bFM4_CANFD0_TXBAR_AR15                    *((volatile  uint8_t *)(0x42E01A3CUL))
#define bFM_CANFD0_TXBAR_AR16                     *((volatile  uint8_t *)(0x42E01A40UL))
#define bFM4_CANFD0_TXBAR_AR16                    *((volatile  uint8_t *)(0x42E01A40UL))
#define bFM_CANFD0_TXBAR_AR17                     *((volatile  uint8_t *)(0x42E01A44UL))
#define bFM4_CANFD0_TXBAR_AR17                    *((volatile  uint8_t *)(0x42E01A44UL))
#define bFM_CANFD0_TXBAR_AR18                     *((volatile  uint8_t *)(0x42E01A48UL))
#define bFM4_CANFD0_TXBAR_AR18                    *((volatile  uint8_t *)(0x42E01A48UL))
#define bFM_CANFD0_TXBAR_AR19                     *((volatile  uint8_t *)(0x42E01A4CUL))
#define bFM4_CANFD0_TXBAR_AR19                    *((volatile  uint8_t *)(0x42E01A4CUL))
#define bFM_CANFD0_TXBAR_AR20                     *((volatile  uint8_t *)(0x42E01A50UL))
#define bFM4_CANFD0_TXBAR_AR20                    *((volatile  uint8_t *)(0x42E01A50UL))
#define bFM_CANFD0_TXBAR_AR21                     *((volatile  uint8_t *)(0x42E01A54UL))
#define bFM4_CANFD0_TXBAR_AR21                    *((volatile  uint8_t *)(0x42E01A54UL))
#define bFM_CANFD0_TXBAR_AR22                     *((volatile  uint8_t *)(0x42E01A58UL))
#define bFM4_CANFD0_TXBAR_AR22                    *((volatile  uint8_t *)(0x42E01A58UL))
#define bFM_CANFD0_TXBAR_AR23                     *((volatile  uint8_t *)(0x42E01A5CUL))
#define bFM4_CANFD0_TXBAR_AR23                    *((volatile  uint8_t *)(0x42E01A5CUL))
#define bFM_CANFD0_TXBAR_AR24                     *((volatile  uint8_t *)(0x42E01A60UL))
#define bFM4_CANFD0_TXBAR_AR24                    *((volatile  uint8_t *)(0x42E01A60UL))
#define bFM_CANFD0_TXBAR_AR25                     *((volatile  uint8_t *)(0x42E01A64UL))
#define bFM4_CANFD0_TXBAR_AR25                    *((volatile  uint8_t *)(0x42E01A64UL))
#define bFM_CANFD0_TXBAR_AR26                     *((volatile  uint8_t *)(0x42E01A68UL))
#define bFM4_CANFD0_TXBAR_AR26                    *((volatile  uint8_t *)(0x42E01A68UL))
#define bFM_CANFD0_TXBAR_AR27                     *((volatile  uint8_t *)(0x42E01A6CUL))
#define bFM4_CANFD0_TXBAR_AR27                    *((volatile  uint8_t *)(0x42E01A6CUL))
#define bFM_CANFD0_TXBAR_AR28                     *((volatile  uint8_t *)(0x42E01A70UL))
#define bFM4_CANFD0_TXBAR_AR28                    *((volatile  uint8_t *)(0x42E01A70UL))
#define bFM_CANFD0_TXBAR_AR29                     *((volatile  uint8_t *)(0x42E01A74UL))
#define bFM4_CANFD0_TXBAR_AR29                    *((volatile  uint8_t *)(0x42E01A74UL))
#define bFM_CANFD0_TXBAR_AR30                     *((volatile  uint8_t *)(0x42E01A78UL))
#define bFM4_CANFD0_TXBAR_AR30                    *((volatile  uint8_t *)(0x42E01A78UL))
#define bFM_CANFD0_TXBAR_AR31                     *((volatile  uint8_t *)(0x42E01A7CUL))
#define bFM4_CANFD0_TXBAR_AR31                    *((volatile  uint8_t *)(0x42E01A7CUL))

#define bFM_CANFD0_TXBC_TFQM                      *((volatile  uint8_t *)(0x42E01878UL))
#define bFM4_CANFD0_TXBC_TFQM                     *((volatile  uint8_t *)(0x42E01878UL))

#define bFM_CANFD0_TXBCF_CF0                      *((volatile  uint8_t *)(0x42E01B80UL))
#define bFM4_CANFD0_TXBCF_CF0                     *((volatile  uint8_t *)(0x42E01B80UL))
#define bFM_CANFD0_TXBCF_CF1                      *((volatile  uint8_t *)(0x42E01B84UL))
#define bFM4_CANFD0_TXBCF_CF1                     *((volatile  uint8_t *)(0x42E01B84UL))
#define bFM_CANFD0_TXBCF_CF2                      *((volatile  uint8_t *)(0x42E01B88UL))
#define bFM4_CANFD0_TXBCF_CF2                     *((volatile  uint8_t *)(0x42E01B88UL))
#define bFM_CANFD0_TXBCF_CF3                      *((volatile  uint8_t *)(0x42E01B8CUL))
#define bFM4_CANFD0_TXBCF_CF3                     *((volatile  uint8_t *)(0x42E01B8CUL))
#define bFM_CANFD0_TXBCF_CF4                      *((volatile  uint8_t *)(0x42E01B90UL))
#define bFM4_CANFD0_TXBCF_CF4                     *((volatile  uint8_t *)(0x42E01B90UL))
#define bFM_CANFD0_TXBCF_CF5                      *((volatile  uint8_t *)(0x42E01B94UL))
#define bFM4_CANFD0_TXBCF_CF5                     *((volatile  uint8_t *)(0x42E01B94UL))
#define bFM_CANFD0_TXBCF_CF6                      *((volatile  uint8_t *)(0x42E01B98UL))
#define bFM4_CANFD0_TXBCF_CF6                     *((volatile  uint8_t *)(0x42E01B98UL))
#define bFM_CANFD0_TXBCF_CF7                      *((volatile  uint8_t *)(0x42E01B9CUL))
#define bFM4_CANFD0_TXBCF_CF7                     *((volatile  uint8_t *)(0x42E01B9CUL))
#define bFM_CANFD0_TXBCF_CF8                      *((volatile  uint8_t *)(0x42E01BA0UL))
#define bFM4_CANFD0_TXBCF_CF8                     *((volatile  uint8_t *)(0x42E01BA0UL))
#define bFM_CANFD0_TXBCF_CF9                      *((volatile  uint8_t *)(0x42E01BA4UL))
#define bFM4_CANFD0_TXBCF_CF9                     *((volatile  uint8_t *)(0x42E01BA4UL))
#define bFM_CANFD0_TXBCF_CF10                     *((volatile  uint8_t *)(0x42E01BA8UL))
#define bFM4_CANFD0_TXBCF_CF10                    *((volatile  uint8_t *)(0x42E01BA8UL))
#define bFM_CANFD0_TXBCF_CF11                     *((volatile  uint8_t *)(0x42E01BACUL))
#define bFM4_CANFD0_TXBCF_CF11                    *((volatile  uint8_t *)(0x42E01BACUL))
#define bFM_CANFD0_TXBCF_CF12                     *((volatile  uint8_t *)(0x42E01BB0UL))
#define bFM4_CANFD0_TXBCF_CF12                    *((volatile  uint8_t *)(0x42E01BB0UL))
#define bFM_CANFD0_TXBCF_CF13                     *((volatile  uint8_t *)(0x42E01BB4UL))
#define bFM4_CANFD0_TXBCF_CF13                    *((volatile  uint8_t *)(0x42E01BB4UL))
#define bFM_CANFD0_TXBCF_CF14                     *((volatile  uint8_t *)(0x42E01BB8UL))
#define bFM4_CANFD0_TXBCF_CF14                    *((volatile  uint8_t *)(0x42E01BB8UL))
#define bFM_CANFD0_TXBCF_CF15                     *((volatile  uint8_t *)(0x42E01BBCUL))
#define bFM4_CANFD0_TXBCF_CF15                    *((volatile  uint8_t *)(0x42E01BBCUL))
#define bFM_CANFD0_TXBCF_CF16                     *((volatile  uint8_t *)(0x42E01BC0UL))
#define bFM4_CANFD0_TXBCF_CF16                    *((volatile  uint8_t *)(0x42E01BC0UL))
#define bFM_CANFD0_TXBCF_CF17                     *((volatile  uint8_t *)(0x42E01BC4UL))
#define bFM4_CANFD0_TXBCF_CF17                    *((volatile  uint8_t *)(0x42E01BC4UL))
#define bFM_CANFD0_TXBCF_CF18                     *((volatile  uint8_t *)(0x42E01BC8UL))
#define bFM4_CANFD0_TXBCF_CF18                    *((volatile  uint8_t *)(0x42E01BC8UL))
#define bFM_CANFD0_TXBCF_CF19                     *((volatile  uint8_t *)(0x42E01BCCUL))
#define bFM4_CANFD0_TXBCF_CF19                    *((volatile  uint8_t *)(0x42E01BCCUL))
#define bFM_CANFD0_TXBCF_CF20                     *((volatile  uint8_t *)(0x42E01BD0UL))
#define bFM4_CANFD0_TXBCF_CF20                    *((volatile  uint8_t *)(0x42E01BD0UL))
#define bFM_CANFD0_TXBCF_CF21                     *((volatile  uint8_t *)(0x42E01BD4UL))
#define bFM4_CANFD0_TXBCF_CF21                    *((volatile  uint8_t *)(0x42E01BD4UL))
#define bFM_CANFD0_TXBCF_CF22                     *((volatile  uint8_t *)(0x42E01BD8UL))
#define bFM4_CANFD0_TXBCF_CF22                    *((volatile  uint8_t *)(0x42E01BD8UL))
#define bFM_CANFD0_TXBCF_CF23                     *((volatile  uint8_t *)(0x42E01BDCUL))
#define bFM4_CANFD0_TXBCF_CF23                    *((volatile  uint8_t *)(0x42E01BDCUL))
#define bFM_CANFD0_TXBCF_CF24                     *((volatile  uint8_t *)(0x42E01BE0UL))
#define bFM4_CANFD0_TXBCF_CF24                    *((volatile  uint8_t *)(0x42E01BE0UL))
#define bFM_CANFD0_TXBCF_CF25                     *((volatile  uint8_t *)(0x42E01BE4UL))
#define bFM4_CANFD0_TXBCF_CF25                    *((volatile  uint8_t *)(0x42E01BE4UL))
#define bFM_CANFD0_TXBCF_CF26                     *((volatile  uint8_t *)(0x42E01BE8UL))
#define bFM4_CANFD0_TXBCF_CF26                    *((volatile  uint8_t *)(0x42E01BE8UL))
#define bFM_CANFD0_TXBCF_CF27                     *((volatile  uint8_t *)(0x42E01BECUL))
#define bFM4_CANFD0_TXBCF_CF27                    *((volatile  uint8_t *)(0x42E01BECUL))
#define bFM_CANFD0_TXBCF_CF28                     *((volatile  uint8_t *)(0x42E01BF0UL))
#define bFM4_CANFD0_TXBCF_CF28                    *((volatile  uint8_t *)(0x42E01BF0UL))
#define bFM_CANFD0_TXBCF_CF29                     *((volatile  uint8_t *)(0x42E01BF4UL))
#define bFM4_CANFD0_TXBCF_CF29                    *((volatile  uint8_t *)(0x42E01BF4UL))
#define bFM_CANFD0_TXBCF_CF30                     *((volatile  uint8_t *)(0x42E01BF8UL))
#define bFM4_CANFD0_TXBCF_CF30                    *((volatile  uint8_t *)(0x42E01BF8UL))
#define bFM_CANFD0_TXBCF_CF31                     *((volatile  uint8_t *)(0x42E01BFCUL))
#define bFM4_CANFD0_TXBCF_CF31                    *((volatile  uint8_t *)(0x42E01BFCUL))

#define bFM_CANFD0_TXBCIE_CFIE0                   *((volatile  uint8_t *)(0x42E01C80UL))
#define bFM4_CANFD0_TXBCIE_CFIE0                  *((volatile  uint8_t *)(0x42E01C80UL))
#define bFM_CANFD0_TXBCIE_CFIE1                   *((volatile  uint8_t *)(0x42E01C84UL))
#define bFM4_CANFD0_TXBCIE_CFIE1                  *((volatile  uint8_t *)(0x42E01C84UL))
#define bFM_CANFD0_TXBCIE_CFIE2                   *((volatile  uint8_t *)(0x42E01C88UL))
#define bFM4_CANFD0_TXBCIE_CFIE2                  *((volatile  uint8_t *)(0x42E01C88UL))
#define bFM_CANFD0_TXBCIE_CFIE3                   *((volatile  uint8_t *)(0x42E01C8CUL))
#define bFM4_CANFD0_TXBCIE_CFIE3                  *((volatile  uint8_t *)(0x42E01C8CUL))
#define bFM_CANFD0_TXBCIE_CFIE4                   *((volatile  uint8_t *)(0x42E01C90UL))
#define bFM4_CANFD0_TXBCIE_CFIE4                  *((volatile  uint8_t *)(0x42E01C90UL))
#define bFM_CANFD0_TXBCIE_CFIE5                   *((volatile  uint8_t *)(0x42E01C94UL))
#define bFM4_CANFD0_TXBCIE_CFIE5                  *((volatile  uint8_t *)(0x42E01C94UL))
#define bFM_CANFD0_TXBCIE_CFIE6                   *((volatile  uint8_t *)(0x42E01C98UL))
#define bFM4_CANFD0_TXBCIE_CFIE6                  *((volatile  uint8_t *)(0x42E01C98UL))
#define bFM_CANFD0_TXBCIE_CFIE7                   *((volatile  uint8_t *)(0x42E01C9CUL))
#define bFM4_CANFD0_TXBCIE_CFIE7                  *((volatile  uint8_t *)(0x42E01C9CUL))
#define bFM_CANFD0_TXBCIE_CFIE8                   *((volatile  uint8_t *)(0x42E01CA0UL))
#define bFM4_CANFD0_TXBCIE_CFIE8                  *((volatile  uint8_t *)(0x42E01CA0UL))
#define bFM_CANFD0_TXBCIE_CFIE9                   *((volatile  uint8_t *)(0x42E01CA4UL))
#define bFM4_CANFD0_TXBCIE_CFIE9                  *((volatile  uint8_t *)(0x42E01CA4UL))
#define bFM_CANFD0_TXBCIE_CFIE10                  *((volatile  uint8_t *)(0x42E01CA8UL))
#define bFM4_CANFD0_TXBCIE_CFIE10                 *((volatile  uint8_t *)(0x42E01CA8UL))
#define bFM_CANFD0_TXBCIE_CFIE11                  *((volatile  uint8_t *)(0x42E01CACUL))
#define bFM4_CANFD0_TXBCIE_CFIE11                 *((volatile  uint8_t *)(0x42E01CACUL))
#define bFM_CANFD0_TXBCIE_CFIE12                  *((volatile  uint8_t *)(0x42E01CB0UL))
#define bFM4_CANFD0_TXBCIE_CFIE12                 *((volatile  uint8_t *)(0x42E01CB0UL))
#define bFM_CANFD0_TXBCIE_CFIE13                  *((volatile  uint8_t *)(0x42E01CB4UL))
#define bFM4_CANFD0_TXBCIE_CFIE13                 *((volatile  uint8_t *)(0x42E01CB4UL))
#define bFM_CANFD0_TXBCIE_CFIE14                  *((volatile  uint8_t *)(0x42E01CB8UL))
#define bFM4_CANFD0_TXBCIE_CFIE14                 *((volatile  uint8_t *)(0x42E01CB8UL))
#define bFM_CANFD0_TXBCIE_CFIE15                  *((volatile  uint8_t *)(0x42E01CBCUL))
#define bFM4_CANFD0_TXBCIE_CFIE15                 *((volatile  uint8_t *)(0x42E01CBCUL))
#define bFM_CANFD0_TXBCIE_CFIE16                  *((volatile  uint8_t *)(0x42E01CC0UL))
#define bFM4_CANFD0_TXBCIE_CFIE16                 *((volatile  uint8_t *)(0x42E01CC0UL))
#define bFM_CANFD0_TXBCIE_CFIE17                  *((volatile  uint8_t *)(0x42E01CC4UL))
#define bFM4_CANFD0_TXBCIE_CFIE17                 *((volatile  uint8_t *)(0x42E01CC4UL))
#define bFM_CANFD0_TXBCIE_CFIE18                  *((volatile  uint8_t *)(0x42E01CC8UL))
#define bFM4_CANFD0_TXBCIE_CFIE18                 *((volatile  uint8_t *)(0x42E01CC8UL))
#define bFM_CANFD0_TXBCIE_CFIE19                  *((volatile  uint8_t *)(0x42E01CCCUL))
#define bFM4_CANFD0_TXBCIE_CFIE19                 *((volatile  uint8_t *)(0x42E01CCCUL))
#define bFM_CANFD0_TXBCIE_CFIE20                  *((volatile  uint8_t *)(0x42E01CD0UL))
#define bFM4_CANFD0_TXBCIE_CFIE20                 *((volatile  uint8_t *)(0x42E01CD0UL))
#define bFM_CANFD0_TXBCIE_CFIE21                  *((volatile  uint8_t *)(0x42E01CD4UL))
#define bFM4_CANFD0_TXBCIE_CFIE21                 *((volatile  uint8_t *)(0x42E01CD4UL))
#define bFM_CANFD0_TXBCIE_CFIE22                  *((volatile  uint8_t *)(0x42E01CD8UL))
#define bFM4_CANFD0_TXBCIE_CFIE22                 *((volatile  uint8_t *)(0x42E01CD8UL))
#define bFM_CANFD0_TXBCIE_CFIE23                  *((volatile  uint8_t *)(0x42E01CDCUL))
#define bFM4_CANFD0_TXBCIE_CFIE23                 *((volatile  uint8_t *)(0x42E01CDCUL))
#define bFM_CANFD0_TXBCIE_CFIE24                  *((volatile  uint8_t *)(0x42E01CE0UL))
#define bFM4_CANFD0_TXBCIE_CFIE24                 *((volatile  uint8_t *)(0x42E01CE0UL))
#define bFM_CANFD0_TXBCIE_CFIE25                  *((volatile  uint8_t *)(0x42E01CE4UL))
#define bFM4_CANFD0_TXBCIE_CFIE25                 *((volatile  uint8_t *)(0x42E01CE4UL))
#define bFM_CANFD0_TXBCIE_CFIE26                  *((volatile  uint8_t *)(0x42E01CE8UL))
#define bFM4_CANFD0_TXBCIE_CFIE26                 *((volatile  uint8_t *)(0x42E01CE8UL))
#define bFM_CANFD0_TXBCIE_CFIE27                  *((volatile  uint8_t *)(0x42E01CECUL))
#define bFM4_CANFD0_TXBCIE_CFIE27                 *((volatile  uint8_t *)(0x42E01CECUL))
#define bFM_CANFD0_TXBCIE_CFIE28                  *((volatile  uint8_t *)(0x42E01CF0UL))
#define bFM4_CANFD0_TXBCIE_CFIE28                 *((volatile  uint8_t *)(0x42E01CF0UL))
#define bFM_CANFD0_TXBCIE_CFIE29                  *((volatile  uint8_t *)(0x42E01CF4UL))
#define bFM4_CANFD0_TXBCIE_CFIE29                 *((volatile  uint8_t *)(0x42E01CF4UL))
#define bFM_CANFD0_TXBCIE_CFIE30                  *((volatile  uint8_t *)(0x42E01CF8UL))
#define bFM4_CANFD0_TXBCIE_CFIE30                 *((volatile  uint8_t *)(0x42E01CF8UL))
#define bFM_CANFD0_TXBCIE_CFIE31                  *((volatile  uint8_t *)(0x42E01CFCUL))
#define bFM4_CANFD0_TXBCIE_CFIE31                 *((volatile  uint8_t *)(0x42E01CFCUL))

