TWilmer/s6e2ccx.ethernet/src/s6e2ccxj/common/s6e2ccxj.h
/*******************************************************************************
* MFS Registers MFS12
*   Bitband Section
*******************************************************************************/
#define bFM_MFS12_CSIO_ESCR_CSFE                  *((volatile  uint8_t *)(0x42718094UL))
#define bFM4_MFS12_CSIO_ESCR_CSFE                 *((volatile  uint8_t *)(0x42718094UL))
#define bFM_MFS12_CSIO_ESCR_L3                    *((volatile  uint8_t *)(0x42718098UL))
#define bFM4_MFS12_CSIO_ESCR_L3                   *((volatile  uint8_t *)(0x42718098UL))
#define bFM_MFS12_CSIO_ESCR_SOP                   *((volatile  uint8_t *)(0x4271809CUL))
#define bFM4_MFS12_CSIO_ESCR_SOP                  *((volatile  uint8_t *)(0x4271809CUL))

#define bFM_MFS12_CSIO_FCR_FE1                    *((volatile  uint8_t *)(0x42718280UL))
#define bFM4_MFS12_CSIO_FCR_FE1                   *((volatile  uint8_t *)(0x42718280UL))
#define bFM_MFS12_CSIO_FCR_FE2                    *((volatile  uint8_t *)(0x42718284UL))
#define bFM4_MFS12_CSIO_FCR_FE2                   *((volatile  uint8_t *)(0x42718284UL))
#define bFM_MFS12_CSIO_FCR_FCL1                   *((volatile  uint8_t *)(0x42718288UL))
#define bFM4_MFS12_CSIO_FCR_FCL1                  *((volatile  uint8_t *)(0x42718288UL))
#define bFM_MFS12_CSIO_FCR_FCL2                   *((volatile  uint8_t *)(0x4271828CUL))
#define bFM4_MFS12_CSIO_FCR_FCL2                  *((volatile  uint8_t *)(0x4271828CUL))
#define bFM_MFS12_CSIO_FCR_FSET                   *((volatile  uint8_t *)(0x42718290UL))
#define bFM4_MFS12_CSIO_FCR_FSET                  *((volatile  uint8_t *)(0x42718290UL))
#define bFM_MFS12_CSIO_FCR_FLD                    *((volatile  uint8_t *)(0x42718294UL))
#define bFM4_MFS12_CSIO_FCR_FLD                   *((volatile  uint8_t *)(0x42718294UL))
#define bFM_MFS12_CSIO_FCR_FLST                   *((volatile  uint8_t *)(0x42718298UL))
#define bFM4_MFS12_CSIO_FCR_FLST                  *((volatile  uint8_t *)(0x42718298UL))
#define bFM_MFS12_CSIO_FCR_FSEL                   *((volatile  uint8_t *)(0x427182A0UL))
#define bFM4_MFS12_CSIO_FCR_FSEL                  *((volatile  uint8_t *)(0x427182A0UL))
#define bFM_MFS12_CSIO_FCR_FTIE                   *((volatile  uint8_t *)(0x427182A4UL))
#define bFM4_MFS12_CSIO_FCR_FTIE                  *((volatile  uint8_t *)(0x427182A4UL))
#define bFM_MFS12_CSIO_FCR_FDRQ                   *((volatile  uint8_t *)(0x427182A8UL))
#define bFM4_MFS12_CSIO_FCR_FDRQ                  *((volatile  uint8_t *)(0x427182A8UL))
#define bFM_MFS12_CSIO_FCR_FRIIE                  *((volatile  uint8_t *)(0x427182ACUL))
#define bFM4_MFS12_CSIO_FCR_FRIIE                 *((volatile  uint8_t *)(0x427182ACUL))
#define bFM_MFS12_CSIO_FCR_FLSTE                  *((volatile  uint8_t *)(0x427182B0UL))
#define bFM4_MFS12_CSIO_FCR_FLSTE                 *((volatile  uint8_t *)(0x427182B0UL))

#define bFM_MFS12_CSIO_SACSR_TMRE                 *((volatile  uint8_t *)(0x42718480UL))
#define bFM4_MFS12_CSIO_SACSR_TMRE                *((volatile  uint8_t *)(0x42718480UL))
#define bFM_MFS12_CSIO_SACSR_TSYNE                *((volatile  uint8_t *)(0x42718498UL))
#define bFM4_MFS12_CSIO_SACSR_TSYNE               *((volatile  uint8_t *)(0x42718498UL))
#define bFM_MFS12_CSIO_SACSR_TINTE                *((volatile  uint8_t *)(0x4271849CUL))
#define bFM4_MFS12_CSIO_SACSR_TINTE               *((volatile  uint8_t *)(0x4271849CUL))
#define bFM_MFS12_CSIO_SACSR_TINT                 *((volatile  uint8_t *)(0x427184A0UL))
#define bFM4_MFS12_CSIO_SACSR_TINT                *((volatile  uint8_t *)(0x427184A0UL))
#define bFM_MFS12_CSIO_SACSR_CSE                  *((volatile  uint8_t *)(0x427184ACUL))
#define bFM4_MFS12_CSIO_SACSR_CSE                 *((volatile  uint8_t *)(0x427184ACUL))
#define bFM_MFS12_CSIO_SACSR_CSEIE                *((volatile  uint8_t *)(0x427184B0UL))
#define bFM4_MFS12_CSIO_SACSR_CSEIE               *((volatile  uint8_t *)(0x427184B0UL))
#define bFM_MFS12_CSIO_SACSR_TBEEN                *((volatile  uint8_t *)(0x427184B4UL))
#define bFM4_MFS12_CSIO_SACSR_TBEEN               *((volatile  uint8_t *)(0x427184B4UL))

#define bFM_MFS12_CSIO_SCR_TXE                    *((volatile  uint8_t *)(0x42718020UL))
#define bFM4_MFS12_CSIO_SCR_TXE                   *((volatile  uint8_t *)(0x42718020UL))
#define bFM_MFS12_CSIO_SCR_RXE                    *((volatile  uint8_t *)(0x42718024UL))
#define bFM4_MFS12_CSIO_SCR_RXE                   *((volatile  uint8_t *)(0x42718024UL))
#define bFM_MFS12_CSIO_SCR_TBIE                   *((volatile  uint8_t *)(0x42718028UL))
#define bFM4_MFS12_CSIO_SCR_TBIE                  *((volatile  uint8_t *)(0x42718028UL))
#define bFM_MFS12_CSIO_SCR_TIE                    *((volatile  uint8_t *)(0x4271802CUL))
#define bFM4_MFS12_CSIO_SCR_TIE                   *((volatile  uint8_t *)(0x4271802CUL))
#define bFM_MFS12_CSIO_SCR_RIE                    *((volatile  uint8_t *)(0x42718030UL))
#define bFM4_MFS12_CSIO_SCR_RIE                   *((volatile  uint8_t *)(0x42718030UL))
#define bFM_MFS12_CSIO_SCR_SPI                    *((volatile  uint8_t *)(0x42718034UL))
#define bFM4_MFS12_CSIO_SCR_SPI                   *((volatile  uint8_t *)(0x42718034UL))
#define bFM_MFS12_CSIO_SCR_MS                     *((volatile  uint8_t *)(0x42718038UL))
#define bFM4_MFS12_CSIO_SCR_MS                    *((volatile  uint8_t *)(0x42718038UL))
#define bFM_MFS12_CSIO_SCR_UPCL                   *((volatile  uint8_t *)(0x4271803CUL))
#define bFM4_MFS12_CSIO_SCR_UPCL                  *((volatile  uint8_t *)(0x4271803CUL))

#define bFM_MFS12_CSIO_SCSCR_CSOE                 *((volatile  uint8_t *)(0x42718600UL))
#define bFM4_MFS12_CSIO_SCSCR_CSOE                *((volatile  uint8_t *)(0x42718600UL))
#define bFM_MFS12_CSIO_SCSCR_CSEN0                *((volatile  uint8_t *)(0x42718604UL))
#define bFM4_MFS12_CSIO_SCSCR_CSEN0               *((volatile  uint8_t *)(0x42718604UL))
#define bFM_MFS12_CSIO_SCSCR_CSEN1                *((volatile  uint8_t *)(0x42718608UL))
#define bFM4_MFS12_CSIO_SCSCR_CSEN1               *((volatile  uint8_t *)(0x42718608UL))
#define bFM_MFS12_CSIO_SCSCR_CSEN2                *((volatile  uint8_t *)(0x4271860CUL))
#define bFM4_MFS12_CSIO_SCSCR_CSEN2               *((volatile  uint8_t *)(0x4271860CUL))
#define bFM_MFS12_CSIO_SCSCR_CSEN3                *((volatile  uint8_t *)(0x42718610UL))
#define bFM4_MFS12_CSIO_SCSCR_CSEN3               *((volatile  uint8_t *)(0x42718610UL))
#define bFM_MFS12_CSIO_SCSCR_CSLVL                *((volatile  uint8_t *)(0x42718614UL))
#define bFM4_MFS12_CSIO_SCSCR_CSLVL               *((volatile  uint8_t *)(0x42718614UL))
#define bFM_MFS12_CSIO_SCSCR_SCAM                 *((volatile  uint8_t *)(0x42718624UL))
#define bFM4_MFS12_CSIO_SCSCR_SCAM                *((volatile  uint8_t *)(0x42718624UL))

#define bFM_MFS12_CSIO_SCSFR0_CS1SPI              *((volatile  uint8_t *)(0x42718694UL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1SPI             *((volatile  uint8_t *)(0x42718694UL))
#define bFM_MFS12_CSIO_SCSFR0_CS1SCINV            *((volatile  uint8_t *)(0x42718698UL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1SCINV           *((volatile  uint8_t *)(0x42718698UL))
#define bFM_MFS12_CSIO_SCSFR0_CS1CSLVL            *((volatile  uint8_t *)(0x4271869CUL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1CSLVL           *((volatile  uint8_t *)(0x4271869CUL))

#define bFM_MFS12_CSIO_SCSFR1_CS2SPI              *((volatile  uint8_t *)(0x427186B4UL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2SPI             *((volatile  uint8_t *)(0x427186B4UL))
#define bFM_MFS12_CSIO_SCSFR1_CS2SCINV            *((volatile  uint8_t *)(0x427186B8UL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2SCINV           *((volatile  uint8_t *)(0x427186B8UL))
#define bFM_MFS12_CSIO_SCSFR1_CS2CSLVL            *((volatile  uint8_t *)(0x427186BCUL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2CSLVL           *((volatile  uint8_t *)(0x427186BCUL))

#define bFM_MFS12_CSIO_SCSFR2_CS3SPI              *((volatile  uint8_t *)(0x42718714UL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3SPI             *((volatile  uint8_t *)(0x42718714UL))
#define bFM_MFS12_CSIO_SCSFR2_CS3SCINV            *((volatile  uint8_t *)(0x42718718UL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3SCINV           *((volatile  uint8_t *)(0x42718718UL))
#define bFM_MFS12_CSIO_SCSFR2_CS3CSLVL            *((volatile  uint8_t *)(0x4271871CUL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3CSLVL           *((volatile  uint8_t *)(0x4271871CUL))

