TWilmer/s6e2ccx.ethernet/src/s6e2ccxj/common/s6e2ccxj.h
#define bFM_MFS14_UART_FCR_FE1                    *((volatile  uint8_t *)(0x4271C280UL))
#define bFM4_MFS14_UART_FCR_FE1                   *((volatile  uint8_t *)(0x4271C280UL))
#define bFM_MFS14_UART_FCR_FE2                    *((volatile  uint8_t *)(0x4271C284UL))
#define bFM4_MFS14_UART_FCR_FE2                   *((volatile  uint8_t *)(0x4271C284UL))
#define bFM_MFS14_UART_FCR_FCL1                   *((volatile  uint8_t *)(0x4271C288UL))
#define bFM4_MFS14_UART_FCR_FCL1                  *((volatile  uint8_t *)(0x4271C288UL))
#define bFM_MFS14_UART_FCR_FCL2                   *((volatile  uint8_t *)(0x4271C28CUL))
#define bFM4_MFS14_UART_FCR_FCL2                  *((volatile  uint8_t *)(0x4271C28CUL))
#define bFM_MFS14_UART_FCR_FSET                   *((volatile  uint8_t *)(0x4271C290UL))
#define bFM4_MFS14_UART_FCR_FSET                  *((volatile  uint8_t *)(0x4271C290UL))
#define bFM_MFS14_UART_FCR_FLD                    *((volatile  uint8_t *)(0x4271C294UL))
#define bFM4_MFS14_UART_FCR_FLD                   *((volatile  uint8_t *)(0x4271C294UL))
#define bFM_MFS14_UART_FCR_FLST                   *((volatile  uint8_t *)(0x4271C298UL))
#define bFM4_MFS14_UART_FCR_FLST                  *((volatile  uint8_t *)(0x4271C298UL))
#define bFM_MFS14_UART_FCR_FSEL                   *((volatile  uint8_t *)(0x4271C2A0UL))
#define bFM4_MFS14_UART_FCR_FSEL                  *((volatile  uint8_t *)(0x4271C2A0UL))
#define bFM_MFS14_UART_FCR_FTIE                   *((volatile  uint8_t *)(0x4271C2A4UL))
#define bFM4_MFS14_UART_FCR_FTIE                  *((volatile  uint8_t *)(0x4271C2A4UL))
#define bFM_MFS14_UART_FCR_FDRQ                   *((volatile  uint8_t *)(0x4271C2A8UL))
#define bFM4_MFS14_UART_FCR_FDRQ                  *((volatile  uint8_t *)(0x4271C2A8UL))
#define bFM_MFS14_UART_FCR_FRIIE                  *((volatile  uint8_t *)(0x4271C2ACUL))
#define bFM4_MFS14_UART_FCR_FRIIE                 *((volatile  uint8_t *)(0x4271C2ACUL))
#define bFM_MFS14_UART_FCR_FLSTE                  *((volatile  uint8_t *)(0x4271C2B0UL))
#define bFM4_MFS14_UART_FCR_FLSTE                 *((volatile  uint8_t *)(0x4271C2B0UL))

#define bFM_MFS14_UART_SCR_TXE                    *((volatile  uint8_t *)(0x4271C020UL))
#define bFM4_MFS14_UART_SCR_TXE                   *((volatile  uint8_t *)(0x4271C020UL))
#define bFM_MFS14_UART_SCR_RXE                    *((volatile  uint8_t *)(0x4271C024UL))
#define bFM4_MFS14_UART_SCR_RXE                   *((volatile  uint8_t *)(0x4271C024UL))
#define bFM_MFS14_UART_SCR_TBIE                   *((volatile  uint8_t *)(0x4271C028UL))
#define bFM4_MFS14_UART_SCR_TBIE                  *((volatile  uint8_t *)(0x4271C028UL))
#define bFM_MFS14_UART_SCR_TIE                    *((volatile  uint8_t *)(0x4271C02CUL))
#define bFM4_MFS14_UART_SCR_TIE                   *((volatile  uint8_t *)(0x4271C02CUL))
#define bFM_MFS14_UART_SCR_RIE                    *((volatile  uint8_t *)(0x4271C030UL))
#define bFM4_MFS14_UART_SCR_RIE                   *((volatile  uint8_t *)(0x4271C030UL))
#define bFM_MFS14_UART_SCR_UPCL                   *((volatile  uint8_t *)(0x4271C03CUL))
#define bFM4_MFS14_UART_SCR_UPCL                  *((volatile  uint8_t *)(0x4271C03CUL))

#define bFM_MFS14_UART_SMR_SOE                    *((volatile  uint8_t *)(0x4271C000UL))
#define bFM4_MFS14_UART_SMR_SOE                   *((volatile  uint8_t *)(0x4271C000UL))
#define bFM_MFS14_UART_SMR_BDS                    *((volatile  uint8_t *)(0x4271C008UL))
#define bFM4_MFS14_UART_SMR_BDS                   *((volatile  uint8_t *)(0x4271C008UL))
#define bFM_MFS14_UART_SMR_SBL                    *((volatile  uint8_t *)(0x4271C00CUL))
#define bFM4_MFS14_UART_SMR_SBL                   *((volatile  uint8_t *)(0x4271C00CUL))

#define bFM_MFS14_UART_SSR_TBI                    *((volatile  uint8_t *)(0x4271C0A0UL))
#define bFM4_MFS14_UART_SSR_TBI                   *((volatile  uint8_t *)(0x4271C0A0UL))
#define bFM_MFS14_UART_SSR_TDRE                   *((volatile  uint8_t *)(0x4271C0A4UL))
#define bFM4_MFS14_UART_SSR_TDRE                  *((volatile  uint8_t *)(0x4271C0A4UL))
#define bFM_MFS14_UART_SSR_RDRF                   *((volatile  uint8_t *)(0x4271C0A8UL))
#define bFM4_MFS14_UART_SSR_RDRF                  *((volatile  uint8_t *)(0x4271C0A8UL))
#define bFM_MFS14_UART_SSR_ORE                    *((volatile  uint8_t *)(0x4271C0ACUL))
#define bFM4_MFS14_UART_SSR_ORE                   *((volatile  uint8_t *)(0x4271C0ACUL))
#define bFM_MFS14_UART_SSR_FRE                    *((volatile  uint8_t *)(0x4271C0B0UL))
#define bFM4_MFS14_UART_SSR_FRE                   *((volatile  uint8_t *)(0x4271C0B0UL))
#define bFM_MFS14_UART_SSR_PE                     *((volatile  uint8_t *)(0x4271C0B4UL))
#define bFM4_MFS14_UART_SSR_PE                    *((volatile  uint8_t *)(0x4271C0B4UL))
#define bFM_MFS14_UART_SSR_REC                    *((volatile  uint8_t *)(0x4271C0BCUL))
#define bFM4_MFS14_UART_SSR_REC                   *((volatile  uint8_t *)(0x4271C0BCUL))


/*******************************************************************************
* MFS Registers MFS15
*   Bitband Section
*******************************************************************************/
#define bFM_MFS15_CSIO_ESCR_CSFE                  *((volatile  uint8_t *)(0x4271E094UL))
#define bFM4_MFS15_CSIO_ESCR_CSFE                 *((volatile  uint8_t *)(0x4271E094UL))
#define bFM_MFS15_CSIO_ESCR_L3                    *((volatile  uint8_t *)(0x4271E098UL))
#define bFM4_MFS15_CSIO_ESCR_L3                   *((volatile  uint8_t *)(0x4271E098UL))
#define bFM_MFS15_CSIO_ESCR_SOP                   *((volatile  uint8_t *)(0x4271E09CUL))
#define bFM4_MFS15_CSIO_ESCR_SOP                  *((volatile  uint8_t *)(0x4271E09CUL))

#define bFM_MFS15_CSIO_FCR_FE1                    *((volatile  uint8_t *)(0x4271E280UL))
#define bFM4_MFS15_CSIO_FCR_FE1                   *((volatile  uint8_t *)(0x4271E280UL))
#define bFM_MFS15_CSIO_FCR_FE2                    *((volatile  uint8_t *)(0x4271E284UL))
#define bFM4_MFS15_CSIO_FCR_FE2                   *((volatile  uint8_t *)(0x4271E284UL))
#define bFM_MFS15_CSIO_FCR_FCL1                   *((volatile  uint8_t *)(0x4271E288UL))
#define bFM4_MFS15_CSIO_FCR_FCL1                  *((volatile  uint8_t *)(0x4271E288UL))
#define bFM_MFS15_CSIO_FCR_FCL2                   *((volatile  uint8_t *)(0x4271E28CUL))
#define bFM4_MFS15_CSIO_FCR_FCL2                  *((volatile  uint8_t *)(0x4271E28CUL))
#define bFM_MFS15_CSIO_FCR_FSET                   *((volatile  uint8_t *)(0x4271E290UL))
#define bFM4_MFS15_CSIO_FCR_FSET                  *((volatile  uint8_t *)(0x4271E290UL))
#define bFM_MFS15_CSIO_FCR_FLD                    *((volatile  uint8_t *)(0x4271E294UL))
#define bFM4_MFS15_CSIO_FCR_FLD                   *((volatile  uint8_t *)(0x4271E294UL))
#define bFM_MFS15_CSIO_FCR_FLST                   *((volatile  uint8_t *)(0x4271E298UL))
#define bFM4_MFS15_CSIO_FCR_FLST                  *((volatile  uint8_t *)(0x4271E298UL))
#define bFM_MFS15_CSIO_FCR_FSEL                   *((volatile  uint8_t *)(0x4271E2A0UL))
#define bFM4_MFS15_CSIO_FCR_FSEL                  *((volatile  uint8_t *)(0x4271E2A0UL))
#define bFM_MFS15_CSIO_FCR_FTIE                   *((volatile  uint8_t *)(0x4271E2A4UL))
#define bFM4_MFS15_CSIO_FCR_FTIE                  *((volatile  uint8_t *)(0x4271E2A4UL))
#define bFM_MFS15_CSIO_FCR_FDRQ                   *((volatile  uint8_t *)(0x4271E2A8UL))
#define bFM4_MFS15_CSIO_FCR_FDRQ                  *((volatile  uint8_t *)(0x4271E2A8UL))
#define bFM_MFS15_CSIO_FCR_FRIIE                  *((volatile  uint8_t *)(0x4271E2ACUL))
#define bFM4_MFS15_CSIO_FCR_FRIIE                 *((volatile  uint8_t *)(0x4271E2ACUL))
#define bFM_MFS15_CSIO_FCR_FLSTE                  *((volatile  uint8_t *)(0x4271E2B0UL))
#define bFM4_MFS15_CSIO_FCR_FLSTE                 *((volatile  uint8_t *)(0x4271E2B0UL))

