TWilmer/s6e2ccx.ethernet/src/s6e2ccxj/common/s6e2ccxj.h
#define bFM_USB0_HSTATE_CSTAT                     *((volatile  uint8_t *)(0x42842100UL))
#define bFM4_USB0_HSTATE_CSTAT                    *((volatile  uint8_t *)(0x42842100UL))
#define bFM_USB0_HSTATE_TMODE                     *((volatile  uint8_t *)(0x42842104UL))
#define bFM4_USB0_HSTATE_TMODE                    *((volatile  uint8_t *)(0x42842104UL))
#define bFM_USB0_HSTATE_SUSP                      *((volatile  uint8_t *)(0x42842108UL))
#define bFM4_USB0_HSTATE_SUSP                     *((volatile  uint8_t *)(0x42842108UL))
#define bFM_USB0_HSTATE_SOFBUSY                   *((volatile  uint8_t *)(0x4284210CUL))
#define bFM4_USB0_HSTATE_SOFBUSY                  *((volatile  uint8_t *)(0x4284210CUL))
#define bFM_USB0_HSTATE_CLKSEL                    *((volatile  uint8_t *)(0x42842110UL))
#define bFM4_USB0_HSTATE_CLKSEL                   *((volatile  uint8_t *)(0x42842110UL))
#define bFM_USB0_HSTATE_ALIVE                     *((volatile  uint8_t *)(0x42842114UL))
#define bFM4_USB0_HSTATE_ALIVE                    *((volatile  uint8_t *)(0x42842114UL))

#define bFM_USB0_HTOKEN_TGGL                      *((volatile  uint8_t *)(0x4284239CUL))
#define bFM4_USB0_HTOKEN_TGGL                     *((volatile  uint8_t *)(0x4284239CUL))

#define bFM_USB0_UDCC_PWC                         *((volatile  uint8_t *)(0x42842400UL))
#define bFM4_USB0_UDCC_PWC                        *((volatile  uint8_t *)(0x42842400UL))
#define bFM_USB0_UDCC_RFBK                        *((volatile  uint8_t *)(0x42842404UL))
#define bFM4_USB0_UDCC_RFBK                       *((volatile  uint8_t *)(0x42842404UL))
#define bFM_USB0_UDCC_STALCLREN                   *((volatile  uint8_t *)(0x4284240CUL))
#define bFM4_USB0_UDCC_STALCLREN                  *((volatile  uint8_t *)(0x4284240CUL))
#define bFM_USB0_UDCC_USTP                        *((volatile  uint8_t *)(0x42842410UL))
#define bFM4_USB0_UDCC_USTP                       *((volatile  uint8_t *)(0x42842410UL))
#define bFM_USB0_UDCC_HCONX                       *((volatile  uint8_t *)(0x42842414UL))
#define bFM4_USB0_UDCC_HCONX                      *((volatile  uint8_t *)(0x42842414UL))
#define bFM_USB0_UDCC_RESUM                       *((volatile  uint8_t *)(0x42842418UL))
#define bFM4_USB0_UDCC_RESUM                      *((volatile  uint8_t *)(0x42842418UL))
#define bFM_USB0_UDCC_RST                         *((volatile  uint8_t *)(0x4284241CUL))
#define bFM4_USB0_UDCC_RST                        *((volatile  uint8_t *)(0x4284241CUL))

#define bFM_USB0_UDCIE_CONFIE                     *((volatile  uint8_t *)(0x42842820UL))
#define bFM4_USB0_UDCIE_CONFIE                    *((volatile  uint8_t *)(0x42842820UL))
#define bFM_USB0_UDCIE_CONFN                      *((volatile  uint8_t *)(0x42842824UL))
#define bFM4_USB0_UDCIE_CONFN                     *((volatile  uint8_t *)(0x42842824UL))
#define bFM_USB0_UDCIE_WKUPIE                     *((volatile  uint8_t *)(0x42842828UL))
#define bFM4_USB0_UDCIE_WKUPIE                    *((volatile  uint8_t *)(0x42842828UL))
#define bFM_USB0_UDCIE_BRSTIE                     *((volatile  uint8_t *)(0x4284282CUL))
#define bFM4_USB0_UDCIE_BRSTIE                    *((volatile  uint8_t *)(0x4284282CUL))
#define bFM_USB0_UDCIE_SOFIE                      *((volatile  uint8_t *)(0x42842830UL))
#define bFM4_USB0_UDCIE_SOFIE                     *((volatile  uint8_t *)(0x42842830UL))
#define bFM_USB0_UDCIE_SUSPIE                     *((volatile  uint8_t *)(0x42842834UL))
#define bFM4_USB0_UDCIE_SUSPIE                    *((volatile  uint8_t *)(0x42842834UL))

#define bFM_USB0_UDCS_CONF                        *((volatile  uint8_t *)(0x42842800UL))
#define bFM4_USB0_UDCS_CONF                       *((volatile  uint8_t *)(0x42842800UL))
#define bFM_USB0_UDCS_SETP                        *((volatile  uint8_t *)(0x42842804UL))
#define bFM4_USB0_UDCS_SETP                       *((volatile  uint8_t *)(0x42842804UL))
#define bFM_USB0_UDCS_WKUP                        *((volatile  uint8_t *)(0x42842808UL))
#define bFM4_USB0_UDCS_WKUP                       *((volatile  uint8_t *)(0x42842808UL))
#define bFM_USB0_UDCS_BRST                        *((volatile  uint8_t *)(0x4284280CUL))
#define bFM4_USB0_UDCS_BRST                       *((volatile  uint8_t *)(0x4284280CUL))
#define bFM_USB0_UDCS_SOF                         *((volatile  uint8_t *)(0x42842810UL))
#define bFM4_USB0_UDCS_SOF                        *((volatile  uint8_t *)(0x42842810UL))
#define bFM_USB0_UDCS_SUSP                        *((volatile  uint8_t *)(0x42842814UL))
#define bFM4_USB0_UDCS_SUSP                       *((volatile  uint8_t *)(0x42842814UL))


/*******************************************************************************
* USB Registers USB1
*   Bitband Section
*******************************************************************************/
#define bFM_USB1_EP0C_STAL                        *((volatile  uint16_t*)(0x42A844A4UL))
#define bFM4_USB1_EP0C_STAL                       *((volatile  uint16_t*)(0x42A844A4UL))

#define bFM_USB1_EP0IS_DRQI                       *((volatile  uint16_t*)(0x42A848A8UL))
#define bFM4_USB1_EP0IS_DRQI                      *((volatile  uint16_t*)(0x42A848A8UL))
#define bFM_USB1_EP0IS_DRQIIE                     *((volatile  uint16_t*)(0x42A848B8UL))
#define bFM4_USB1_EP0IS_DRQIIE                    *((volatile  uint16_t*)(0x42A848B8UL))
#define bFM_USB1_EP0IS_BFINI                      *((volatile  uint16_t*)(0x42A848BCUL))
#define bFM4_USB1_EP0IS_BFINI                     *((volatile  uint16_t*)(0x42A848BCUL))

#define bFM_USB1_EP0OS_SPK                        *((volatile  uint16_t*)(0x42A84924UL))
#define bFM4_USB1_EP0OS_SPK                       *((volatile  uint16_t*)(0x42A84924UL))
#define bFM_USB1_EP0OS_DRQO                       *((volatile  uint16_t*)(0x42A84928UL))
#define bFM4_USB1_EP0OS_DRQO                      *((volatile  uint16_t*)(0x42A84928UL))
#define bFM_USB1_EP0OS_SPKIE                      *((volatile  uint16_t*)(0x42A84934UL))
#define bFM4_USB1_EP0OS_SPKIE                     *((volatile  uint16_t*)(0x42A84934UL))
#define bFM_USB1_EP0OS_DRQOIE                     *((volatile  uint16_t*)(0x42A84938UL))
#define bFM4_USB1_EP0OS_DRQOIE                    *((volatile  uint16_t*)(0x42A84938UL))
#define bFM_USB1_EP0OS_BFINI                      *((volatile  uint16_t*)(0x42A8493CUL))
#define bFM4_USB1_EP0OS_BFINI                     *((volatile  uint16_t*)(0x42A8493CUL))

#define bFM_USB1_EP1C_STAL                        *((volatile  uint16_t*)(0x42A84524UL))
#define bFM4_USB1_EP1C_STAL                       *((volatile  uint16_t*)(0x42A84524UL))
#define bFM_USB1_EP1C_NULE                        *((volatile  uint16_t*)(0x42A84528UL))
#define bFM4_USB1_EP1C_NULE                       *((volatile  uint16_t*)(0x42A84528UL))
#define bFM_USB1_EP1C_DMAE                        *((volatile  uint16_t*)(0x42A8452CUL))
#define bFM4_USB1_EP1C_DMAE                       *((volatile  uint16_t*)(0x42A8452CUL))
#define bFM_USB1_EP1C_DIR                         *((volatile  uint16_t*)(0x42A84530UL))
#define bFM4_USB1_EP1C_DIR                        *((volatile  uint16_t*)(0x42A84530UL))
#define bFM_USB1_EP1C_EPEN                        *((volatile  uint16_t*)(0x42A8453CUL))
#define bFM4_USB1_EP1C_EPEN                       *((volatile  uint16_t*)(0x42A8453CUL))

#define bFM_USB1_EP1S_SPK                         *((volatile  uint16_t*)(0x42A849A4UL))
#define bFM4_USB1_EP1S_SPK                        *((volatile  uint16_t*)(0x42A849A4UL))
#define bFM_USB1_EP1S_DRQ                         *((volatile  uint16_t*)(0x42A849A8UL))
#define bFM4_USB1_EP1S_DRQ                        *((volatile  uint16_t*)(0x42A849A8UL))
#define bFM_USB1_EP1S_BUSY                        *((volatile  uint16_t*)(0x42A849ACUL))
#define bFM4_USB1_EP1S_BUSY                       *((volatile  uint16_t*)(0x42A849ACUL))
#define bFM_USB1_EP1S_SPKIE                       *((volatile  uint16_t*)(0x42A849B4UL))
#define bFM4_USB1_EP1S_SPKIE                      *((volatile  uint16_t*)(0x42A849B4UL))
#define bFM_USB1_EP1S_DRQIE                       *((volatile  uint16_t*)(0x42A849B8UL))
#define bFM4_USB1_EP1S_DRQIE                      *((volatile  uint16_t*)(0x42A849B8UL))
#define bFM_USB1_EP1S_BFINI                       *((volatile  uint16_t*)(0x42A849BCUL))
#define bFM4_USB1_EP1S_BFINI                      *((volatile  uint16_t*)(0x42A849BCUL))

#define bFM_USB1_EP2C_STAL                        *((volatile  uint16_t*)(0x42A845A4UL))
#define bFM4_USB1_EP2C_STAL                       *((volatile  uint16_t*)(0x42A845A4UL))
#define bFM_USB1_EP2C_NULE                        *((volatile  uint16_t*)(0x42A845A8UL))
#define bFM4_USB1_EP2C_NULE                       *((volatile  uint16_t*)(0x42A845A8UL))
#define bFM_USB1_EP2C_DMAE                        *((volatile  uint16_t*)(0x42A845ACUL))
#define bFM4_USB1_EP2C_DMAE                       *((volatile  uint16_t*)(0x42A845ACUL))
#define bFM_USB1_EP2C_DIR                         *((volatile  uint16_t*)(0x42A845B0UL))
#define bFM4_USB1_EP2C_DIR                        *((volatile  uint16_t*)(0x42A845B0UL))
#define bFM_USB1_EP2C_EPEN                        *((volatile  uint16_t*)(0x42A845BCUL))
#define bFM4_USB1_EP2C_EPEN                       *((volatile  uint16_t*)(0x42A845BCUL))

#define bFM_USB1_EP2S_SPK                         *((volatile  uint16_t*)(0x42A84A24UL))
#define bFM4_USB1_EP2S_SPK                        *((volatile  uint16_t*)(0x42A84A24UL))
#define bFM_USB1_EP2S_DRQ                         *((volatile  uint16_t*)(0x42A84A28UL))
#define bFM4_USB1_EP2S_DRQ                        *((volatile  uint16_t*)(0x42A84A28UL))
#define bFM_USB1_EP2S_BUSY                        *((volatile  uint16_t*)(0x42A84A2CUL))
#define bFM4_USB1_EP2S_BUSY                       *((volatile  uint16_t*)(0x42A84A2CUL))
#define bFM_USB1_EP2S_SPKIE                       *((volatile  uint16_t*)(0x42A84A34UL))
#define bFM4_USB1_EP2S_SPKIE                      *((volatile  uint16_t*)(0x42A84A34UL))
#define bFM_USB1_EP2S_DRQIE                       *((volatile  uint16_t*)(0x42A84A38UL))
#define bFM4_USB1_EP2S_DRQIE                      *((volatile  uint16_t*)(0x42A84A38UL))
#define bFM_USB1_EP2S_BFINI                       *((volatile  uint16_t*)(0x42A84A3CUL))
#define bFM4_USB1_EP2S_BFINI                      *((volatile  uint16_t*)(0x42A84A3CUL))

#define bFM_USB1_EP3C_STAL                        *((volatile  uint16_t*)(0x42A84624UL))
#define bFM4_USB1_EP3C_STAL                       *((volatile  uint16_t*)(0x42A84624UL))
#define bFM_USB1_EP3C_NULE                        *((volatile  uint16_t*)(0x42A84628UL))
#define bFM4_USB1_EP3C_NULE                       *((volatile  uint16_t*)(0x42A84628UL))
#define bFM_USB1_EP3C_DMAE                        *((volatile  uint16_t*)(0x42A8462CUL))
#define bFM4_USB1_EP3C_DMAE                       *((volatile  uint16_t*)(0x42A8462CUL))
#define bFM_USB1_EP3C_DIR                         *((volatile  uint16_t*)(0x42A84630UL))
#define bFM4_USB1_EP3C_DIR                        *((volatile  uint16_t*)(0x42A84630UL))
#define bFM_USB1_EP3C_EPEN                        *((volatile  uint16_t*)(0x42A8463CUL))
#define bFM4_USB1_EP3C_EPEN                       *((volatile  uint16_t*)(0x42A8463CUL))

#define bFM_USB1_EP3S_SPK                         *((volatile  uint16_t*)(0x42A84AA4UL))
#define bFM4_USB1_EP3S_SPK                        *((volatile  uint16_t*)(0x42A84AA4UL))
#define bFM_USB1_EP3S_DRQ                         *((volatile  uint16_t*)(0x42A84AA8UL))
#define bFM4_USB1_EP3S_DRQ                        *((volatile  uint16_t*)(0x42A84AA8UL))
#define bFM_USB1_EP3S_BUSY                        *((volatile  uint16_t*)(0x42A84AACUL))
#define bFM4_USB1_EP3S_BUSY                       *((volatile  uint16_t*)(0x42A84AACUL))
#define bFM_USB1_EP3S_SPKIE                       *((volatile  uint16_t*)(0x42A84AB4UL))
#define bFM4_USB1_EP3S_SPKIE                      *((volatile  uint16_t*)(0x42A84AB4UL))
#define bFM_USB1_EP3S_DRQIE                       *((volatile  uint16_t*)(0x42A84AB8UL))
#define bFM4_USB1_EP3S_DRQIE                      *((volatile  uint16_t*)(0x42A84AB8UL))
#define bFM_USB1_EP3S_BFINI                       *((volatile  uint16_t*)(0x42A84ABCUL))
#define bFM4_USB1_EP3S_BFINI                      *((volatile  uint16_t*)(0x42A84ABCUL))

#define bFM_USB1_EP4C_STAL                        *((volatile  uint16_t*)(0x42A846A4UL))
#define bFM4_USB1_EP4C_STAL                       *((volatile  uint16_t*)(0x42A846A4UL))
#define bFM_USB1_EP4C_NULE                        *((volatile  uint16_t*)(0x42A846A8UL))
#define bFM4_USB1_EP4C_NULE                       *((volatile  uint16_t*)(0x42A846A8UL))
#define bFM_USB1_EP4C_DMAE                        *((volatile  uint16_t*)(0x42A846ACUL))
#define bFM4_USB1_EP4C_DMAE                       *((volatile  uint16_t*)(0x42A846ACUL))
#define bFM_USB1_EP4C_DIR                         *((volatile  uint16_t*)(0x42A846B0UL))
#define bFM4_USB1_EP4C_DIR                        *((volatile  uint16_t*)(0x42A846B0UL))
#define bFM_USB1_EP4C_EPEN                        *((volatile  uint16_t*)(0x42A846BCUL))
#define bFM4_USB1_EP4C_EPEN                       *((volatile  uint16_t*)(0x42A846BCUL))

#define bFM_USB1_EP4S_SPK                         *((volatile  uint16_t*)(0x42A84B24UL))
#define bFM4_USB1_EP4S_SPK                        *((volatile  uint16_t*)(0x42A84B24UL))
#define bFM_USB1_EP4S_DRQ                         *((volatile  uint16_t*)(0x42A84B28UL))
#define bFM4_USB1_EP4S_DRQ                        *((volatile  uint16_t*)(0x42A84B28UL))
#define bFM_USB1_EP4S_BUSY                        *((volatile  uint16_t*)(0x42A84B2CUL))
#define bFM4_USB1_EP4S_BUSY                       *((volatile  uint16_t*)(0x42A84B2CUL))
#define bFM_USB1_EP4S_SPKIE                       *((volatile  uint16_t*)(0x42A84B34UL))
#define bFM4_USB1_EP4S_SPKIE                      *((volatile  uint16_t*)(0x42A84B34UL))
#define bFM_USB1_EP4S_DRQIE                       *((volatile  uint16_t*)(0x42A84B38UL))
#define bFM4_USB1_EP4S_DRQIE                      *((volatile  uint16_t*)(0x42A84B38UL))
#define bFM_USB1_EP4S_BFINI                       *((volatile  uint16_t*)(0x42A84B3CUL))
#define bFM4_USB1_EP4S_BFINI                      *((volatile  uint16_t*)(0x42A84B3CUL))

